BrandonDHaskell/Portunus/access_module/test/host_idf/sdkconfig.defaults
# Tier B host test sdkconfig defaults
# Target: linux (POSIX FreeRTOS simulator)
CONFIG_IDF_TARGET="linux"

# Enable the ACCESS_POINT FSM variant for behavioral tests
CONFIG_PORTUNUS_MODULE_TYPE_ACCESS_POINT=y

# WiFi disabled — tests run offline; has_network=false unless set explicitly
# CONFIG_PORTUNUS_ENABLE_WIFI is not set

# Timing constants used by the FSM (match production defaults)
CONFIG_PORTUNUS_UNLOCK_HOLD_MS=5000
CONFIG_PORTUNUS_FSM_POLL_INTERVAL_MS=50
CONFIG_PORTUNUS_MFRC522_POLL_INTERVAL_MS=250
CONFIG_PORTUNUS_CARD_REREAD_DELAY_MS=1000
CONFIG_PORTUNUS_HEARTBEAT_INTERVAL_MS=30000
CONFIG_PORTUNUS_EVENT_QUEUE_TIMEOUT_MS=10
CONFIG_PORTUNUS_EVENT_QUEUE_LENGTH=16
CONFIG_PORTUNUS_MAX_EVENT_SUBSCRIBERS=16
CONFIG_PORTUNUS_PROVISION_TIMEOUT_MS=30000
CONFIG_PORTUNUS_ARM_TIMEOUT_MS=60000
CONFIG_PORTUNUS_IDLE_TIMEOUT_MS=300000
CONFIG_PORTUNUS_RESULT_DISPLAY_MS=3000
